Autodesk.Navisworks.Api.Plugins.HomeScreenExtensionPluginRecord
Represents a HomeScreenExtensionPlugin record in Navisworks

Autodesk.Navisworks.Api.Plugins.HomeScreenExtensionPluginRecord.LoadPlugin
Returns the plugin, loads it if required
Throws Autodesk.Navisworks.Api.Plugins.PluginLoadException: Plugin failed to load